Repository: JuanjoAICodes/ReadVeriFast
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Your guest progress has been transferred to your new account!
es: ¡Tu progreso de invitado ha sido transferido a tu nueva cuenta!

source: Congratulations, you are now a registered user!
es: ¡Felicidades, ya eres un usuario registrado!

source: Invalid email or password
es: Email o contraseña inválidos

source: You have been logged out.
es: Has cerrado sesión correctamente.

source: Esta URL ya ha sido sentada anteriormente.
es: Esta URL ya ha sido enviada anteriormente.

source: Submit Article
es: Enviar Artículo

source: Welcome to VeriFast
es: Bienvenido a VeriFast

source: Latest Articles
es: Últimos Artículos

source: Trending Articles
es: Artículos del Momento

source: Explore Tags
es: Explorar Etiquetas

source: Articles
es: Artículos

source: My Profile
es: Mi Perfil

source: Logout
es: Cerrar Sesión

source: Login
es: Iniciar Sesión

source: Register
es: Registrarse

source: Community Pick
es: Aporte de la Comunidad

source: From our feed
es: De nuestro feed

source: Submitted by
es: Enviado por

source: Date
es: Fecha

source: on
es: el

source: Speed Reader
es: Lector Rápido

source: Click "Start"
es: Haz clic en "Iniciar"

source: Speed
es: Velocidad

source: WPM
es: PPM

source: Start
es: Iniciar

source: Comprehension Quiz
es: Cuestionario de Comprensión

source: Submit Answers
es: Enviar Respuestas

source: The quiz for this article is not yet available.
es: El cuestionario para este artículo aún no está disponible.

source: Explore Articles
es: Explorar Artículos

source: Previous
es: Anterior

source: Next
es: Siguiente

source: No articles are available at the moment.
es: No hay artículos disponibles en este momento.

source: Articles about
es: Artículos sobre

source: No articles available for this tag.
es: No hay artículos disponibles para esta etiqueta.

source: Click on a tag to see all related articles.
es: Haz clic en una etiqueta para ver todos los artículos relacionados.

source: No tags available yet.
es: Aún no hay etiquetas disponibles.

source: Read Twice as Fast. Remember Twice as Much.
es: Lee el Doble de Rápido. Recuerda el Doble.

source: VeriFast transforms any web article into an interactive learning experience. Improve your reading speed and validate your comprehension with AI-generated quizzes.
es: VeriFast transforma cualquier artículo web en una experiencia de aprendizaje interactiva. Mejora tu velocidad de lectura y valida tu comprensión con cuestionarios generados por IA.

source: How Does It Work?
es: ¿Cómo Funciona?

source: 1. Paste a URL
es: 1. Pega una URL

source: Find an article you're interested in on the web and submit it to our platform.
es: Encuentra un artículo que te interese en la web y envíalo a nuestra plataforma.

source: 2. Read at Your Pace
es: 2. Lee a tu Ritmo

source: Use our speed-reading tool to absorb the content at your chosen speed.
es: Utiliza nuestra herramienta de lectura rápida para asimilar el contenido a la velocidad que elijas.

source: 3. Validate Comprehension
es: 3. Valida tu Comprensión

source: Answer an AI-generated quiz to ensure you've retained the key information.
es: Responde un cuestionario generado por IA para asegurar que has retenido la información clave.

source: Key Benefits
es: Beneficios Clave

source: Dramatically increase your reading speed (WPM).
es: Aumenta drásticamente tu velocidad de lectura (PPM).

source: Improve long-term information retention.
es: Mejora la retención de información a largo plazo.

source: Get instant feedback on your comprehension.
es: Obtén retroalimentación instantánea sobre tu comprensión.

source: Track your progress with XP and speed statistics.
es: Sigue tu progreso con estadísticas de XP y velocidad.

source: Discover new content based on your interests.
es: Descubre contenido nuevo basado en tus intereses.

source: Congratulations, quiz passed!
es: ¡Felicidades, cuestionario superado!

source: You have earned
es: Has ganado

source: Your total experience is now
es: Tu total de experiencia es ahora

source: Error Review
es: Revisión de Errores

source: Question
es: Pregunta

source: Your answer
es: Tu respuesta

source: Correct answer
es: Respuesta correcta

source: What to do now?
es: ¿Qué hacer ahora?

source: Next Article
es: Siguiente Artículo

source: Back to Articles
es: Volver a Artículos

source: The most read articles in the last few days.
es: Los artículos más leídos en los últimos días.

source: Not enough data to show trending articles yet.
es: Aún no hay datos suficientes para mostrar artículos en tendencia.
